{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Sven Malvik&#39;s Blog",
  "language": "en",
  "home_page_url": "http://localhost:8080/",
  "feed_url": "http://localhost:8080/feed.json",
  "description": "Insights about AI leadership, tech, and trance music - sharing my journey at the intersection of technology and music.",
  "authors": [
    {
      "name": "Sven Malvik"
    }
  ],
  "items": [{
      "id": "http://localhost:8080/blog/vippsi-gets-smarter-expanding-file-support/",
      "url": "http://localhost:8080/blog/vippsi-gets-smarter-expanding-file-support/",
      "title": "Vippsi Gets Smarter: Expanding File Support",
      "content_html": "<p>Hey AI enthusiasts! 👋</p><p>I’m excited to share significant improvements to Vippsi, our AI-powered conversation tool. Imagine having a natural conversation with your entire organization’s knowledge base - asking questions about policies, documentation, or reports, and getting instant, contextual responses. Instead of scanning through hundreds of pages, you can simply ask questions in plain language and get precise answers drawn directly from your documents.</p><p>As a financial services company, Vipps MobilePay faces unique challenges with AI adoption. While solutions like OpenAI, Anthropic, or Google offer powerful capabilities, they aren’t always suitable for our needs. Financial institutions require stringent compliance measures and data privacy guarantees, while keeping costs manageable at scale. That’s why we’re building Vippsi as a custom solution that puts privacy and compliance first.</p><h2 id=\"whats-new\"><a href=\"#whats-new\" class=\"heading-anchor\">What’s New?</a></h2><p>We’re expanding Vippsi to support multiple file formats:</p><ul class=\"list\"><li>PDF documents</li><li>Word documents (DOCX)</li><li>PowerPoint presentations (PPTX)</li><li>Plain text files (TXT)</li><li>More formats coming soon</li></ul><h2 id=\"technical-architecture\"><a href=\"#technical-architecture\" class=\"heading-anchor\">Technical Architecture</a></h2><p>The new architecture moves document processing to the backend while maintaining strict privacy:</p><ul class=\"list\"><li>Zero backend storage - no database, no conversation history being stored in the backend</li><li>Local-first approach - everything stays in your browser’s IndexDB</li><li>Efficient file handling - backend processes files but never stores them</li><li>Smart streaming - content returns as base64 encoded chunks</li><li>Stateless design - subsequent prompts include encoded file content</li></ul><h2 id=\"current-status-and-next-steps\"><a href=\"#current-status-and-next-steps\" class=\"heading-anchor\">Current Status &amp; Next Steps</a></h2><p>The backend architecture is ready, while frontend work continues:</p><ul class=\"list\"><li>Optimizing file upload experience</li><li>Implementing streaming UI feedback</li><li>Fine-tuning document conversations</li><li>Adding support for more formats</li><li>Enhancing conversation quality</li></ul><p>Stay tuned for more updates as we continue to enhance Vippsi’s capabilities!</p><p>~ Sven</p>",
      "date_published": "2025-01-02T00:00:00Z"
    }
    ,{
      "id": "http://localhost:8080/blog/welcome-to-my-new-digital-home/",
      "url": "http://localhost:8080/blog/welcome-to-my-new-digital-home/",
      "title": "Welcome to My New Digital Home",
      "content_html": "<p>Hey everyone! 👋</p><p>I’m excited to launch my new website where I’ll be sharing my journey at the intersection of AI and trance music. This space will be my digital garden where I cultivate ideas, share experiences, and connect with like-minded people.</p><h2 id=\"what-to-expect\"><a href=\"#what-to-expect\" class=\"heading-anchor\">What to Expect</a></h2><p>Here’s what you’ll find on this site:</p><ul class=\"list\"><li><strong>AI Leadership</strong>: Insights from my work leading the AI Platform Team at Vipps MobilePay, where we’re using AI to simplify complex workflows</li><li><strong>Trance Music</strong>: Weekly updates about my latest mixes, featuring both classic anthems and fresh progressive tunes</li><li><strong>Tech Insights</strong>: Thoughts about technology, leadership, and the future of AI</li><li><strong>Personal Updates</strong>: Stories and experiences from my life in Norway</li></ul><h2 id=\"why-this-site\"><a href=\"#why-this-site\" class=\"heading-anchor\">Why This Site?</a></h2><p>I believe in the power of sharing knowledge and experiences. Whether it’s discussing how we’re implementing AI solutions at Vipps MobilePay or sharing the story behind my latest trance mix, this site is where I’ll keep track of my journey.</p><h2 id=\"stay-connected\"><a href=\"#stay-connected\" class=\"heading-anchor\">Stay Connected</a></h2><p>The best way to keep up with my content is to:</p><ul class=\"list\"><li>Follow me on <a href=\"https://www.linkedin.com/in/svenmalvik\" rel=\"noopener\">LinkedIn</a> for tech updates</li><li>Subscribe to my <a href=\"https://www.youtube.com/@svenmalvik\" rel=\"noopener\">YouTube channel</a> for weekly trance mixes</li><li>Check back here regularly for in-depth articles and insights</li></ul><p>Looking forward to sharing this journey with you!</p><p>~ Sven</p>",
      "date_published": "2025-01-01T00:00:00Z"
    }
    
  ]
}