{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Sven Malvik&#39;s Blog",
  "language": "en",
  "home_page_url": "http://localhost:8080/",
  "feed_url": "http://localhost:8080/feed.json",
  "description": "Insights about AI leadership, tech, and trance music - sharing my journey at the intersection of technology and music.",
  "authors": [
    {
      "name": "Sven Malvik"
    }
  ],
  "items": [{
      "id": "http://localhost:8080/blog/azure-api-management-challenges-finding-the-right-path/",
      "url": "http://localhost:8080/blog/azure-api-management-challenges-finding-the-right-path/",
      "title": "Azure API Management Challenges: Finding the Right Path",
      "content_html": "<p>Hey cloud architects! 👋</p><p>Following up on <a href=\"/blog/vippsi-gets-smarter-expanding-file-support/\">yesterday’s post</a> about our document processing system, I wanted to share some interesting challenges we’ve encountered with Azure API Management (APIM) and the solutions we’re exploring.</p><h2 id=\"the-challenge\"><a href=\"#the-challenge\" class=\"heading-anchor\">The Challenge</a></h2><p>While implementing our document processing system, we’ve hit a limitation with Azure API Management: it struggles with payloads larger than 100kB. This presents an interesting architectural decision point for our system.</p><h2 id=\"attempted-solutions\"><a href=\"#attempted-solutions\" class=\"heading-anchor\">Attempted Solutions</a></h2><p>There’s actually a policy-based approach in APIM that supposedly handles larger payloads:</p><pre class=\"language-xml\"><code class=\"language-xml\"><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>validate-content</span> <span class=\"token attr-name\">unspecified-content-type-action</span><span class=\"token attr-value\"><span class=\"token punctuation attr-equals\">=</span><span class=\"token punctuation\">\"</span>ignore<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">max-size</span><span class=\"token attr-value\"><span class=\"token punctuation attr-equals\">=</span><span class=\"token punctuation\">\"</span>4194304<span class=\"token punctuation\">\"</span></span> <span class=\"token punctuation\">/&gt;</span></span></code></pre><p>However, this solution comes with its own set of challenges:</p><ul class=\"list\"><li>The policy doesn’t seem to work reliably in practice</li><li>It adds another layer of complexity to our APIM policies</li><li>When combined with CORS handling, the policies become increasingly complex</li><li>Policy maintenance becomes a significant overhead</li></ul><h2 id=\"current-workaround\"><a href=\"#current-workaround\" class=\"heading-anchor\">Current Workaround</a></h2><p>As a temporary measure, we’ve implemented a simple file size limit of 100kB. While this gets us moving, it’s clearly not the long-term solution we need for handling larger documents effectively.</p><h2 id=\"the-path-forward\"><a href=\"#the-path-forward\" class=\"heading-anchor\">The Path Forward</a></h2><p>I’m exploring a more robust approach:</p><ul class=\"list\"><li>Moving files to Azure Storage Account</li><li>Maintaining only references in local IndexDB</li><li>Preserving user privacy by avoiding direct user-file associations</li><li>Bypassing APIM size limitations entirely</li></ul><p>While we could technically increase APIM’s limit to 4MB through a support ticket, I’m leaning towards the Storage Account solution as it provides better scalability and architectural cleanliness. This would also help us avoid the complexity trap of managing intricate APIM policies.</p><h2 id=\"deep-dive-into-apim\"><a href=\"#deep-dive-into-apim\" class=\"heading-anchor\">Deep Dive into APIM</a></h2><p><picture><source type=\"image/webp\" srcset=\"/assets/images/PD6uaSZcxS-440.webp 440w\" sizes=\"90vw\"><img loading=\"lazy\" decoding=\"async\" alt=\"Mastering Azure API Management book cover\" src=\"/assets/images/PD6uaSZcxS-440.jpeg\" width=\"440\" height=\"621\"></picture></p><p>If you’re interested in mastering Azure API Management and want to learn more about handling these kinds of challenges (and many others), check out my book <a href=\"https://www.amazon.com/Mastering-Azure-API-Management-Implementing/dp/1484280105\" rel=\"noopener\">“Mastering Azure API Management”</a>. It covers everything from basic setup to advanced scenarios, including detailed discussions about policies, security, and architectural best practices.</p><p>Stay tuned as we continue to evolve our document processing architecture!</p><p>~ Sven</p>",
      "date_published": "2025-01-03T00:00:00Z"
    }
    ,{
      "id": "http://localhost:8080/blog/vippsi-gets-smarter-expanding-file-support/",
      "url": "http://localhost:8080/blog/vippsi-gets-smarter-expanding-file-support/",
      "title": "Vippsi Gets Smarter: Expanding File Support",
      "content_html": "<p>Hey AI enthusiasts! 👋</p><p>I’ve been heads down working on Vippsi, our internal AI-powered conversation tool, and wanted to share what I’ve been up to. Imagine having a natural conversation with your entire organization’s knowledge base - asking questions about policies, documentation, or reports, and getting instant, contextual responses. Instead of scanning through hundreds of pages, you can simply ask questions in plain language and get precise answers drawn directly from your documents.</p><p>As a financial services company, Vipps MobilePay faces unique challenges with AI adoption. While solutions like OpenAI, Anthropic, or Google offer powerful capabilities, they aren’t always suitable for our needs. Financial institutions require stringent compliance measures and data privacy guarantees, while keeping costs manageable at scale. That’s why we’re building Vippsi as a custom solution that puts privacy and compliance first.</p><h2 id=\"work-in-progress\"><a href=\"#work-in-progress\" class=\"heading-anchor\">Work in Progress</a></h2><p>We’re expanding Vippsi to support multiple file formats:</p><ul class=\"list\"><li>PDF documents</li><li>Word documents (DOCX)</li><li>PowerPoint presentations (PPTX)</li><li>Plain text files (TXT)</li><li>More formats coming soon</li></ul><h2 id=\"technical-architecture\"><a href=\"#technical-architecture\" class=\"heading-anchor\">Technical Architecture</a></h2><p>Let me explain how we’re handling your documents behind the scenes. When you upload a file, it’s processed in our backend but - and this is crucial - we never store anything. Think of it like having a conversation with someone who can read your document, answer your questions, but immediately forgets everything once you’re done.</p><p>Your files and conversations stay right in your browser using IndexDB storage. When you chat about a document, we convert its content to base64 format (a way to represent binary data as text) and stream it back to your browser. This base64 version gets stored locally and is used in your future conversations, making subsequent interactions quick and efficient while keeping everything on your device.</p><p>Here’s where it gets clever: Each time you ask a new question, your browser sends the base64 encoded content, which is much smaller than the original document. No need for storage on our end, no conversation history to worry about - everything stays private and under your control.</p><h2 id=\"current-status-and-next-steps\"><a href=\"#current-status-and-next-steps\" class=\"heading-anchor\">Current Status &amp; Next Steps</a></h2><p>The backend architecture is ready, while frontend work continues:</p><ul class=\"list\"><li>Optimizing file upload experience</li><li>Implementing streaming UI feedback</li><li>Fine-tuning document conversations</li><li>Adding support for more formats</li><li>Enhancing conversation quality</li></ul><p>Stay tuned for more updates as we continue to enhance Vippsi’s capabilities!</p><p>~ Sven</p>",
      "date_published": "2025-01-02T00:00:00Z"
    }
    ,{
      "id": "http://localhost:8080/blog/welcome-to-my-new-digital-home/",
      "url": "http://localhost:8080/blog/welcome-to-my-new-digital-home/",
      "title": "Welcome to My New Digital Home",
      "content_html": "<p>Hey everyone! 👋</p><p>I’m excited to launch my new website where I’ll be sharing my journey at the intersection of AI and trance music. This space will be my digital garden where I cultivate ideas, share experiences, and connect with like-minded people.</p><h2 id=\"what-to-expect\"><a href=\"#what-to-expect\" class=\"heading-anchor\">What to Expect</a></h2><p>Here’s what you’ll find on this site:</p><ul class=\"list\"><li><strong>AI Leadership</strong>: Insights from my work leading the AI Platform Team at Vipps MobilePay, where we’re using AI to simplify complex workflows</li><li><strong>Trance Music</strong>: Weekly updates about my latest mixes, featuring both classic anthems and fresh progressive tunes</li><li><strong>Tech Insights</strong>: Thoughts about technology, leadership, and the future of AI</li><li><strong>Personal Updates</strong>: Stories and experiences from my life in Norway</li></ul><h2 id=\"why-this-site\"><a href=\"#why-this-site\" class=\"heading-anchor\">Why This Site?</a></h2><p>I believe in the power of sharing knowledge and experiences. Whether it’s discussing how we’re implementing AI solutions at Vipps MobilePay or sharing the story behind my latest trance mix, this site is where I’ll keep track of my journey.</p><h2 id=\"stay-connected\"><a href=\"#stay-connected\" class=\"heading-anchor\">Stay Connected</a></h2><p>The best way to keep up with my content is to:</p><ul class=\"list\"><li>Follow me on <a href=\"https://www.linkedin.com/in/svenmalvik\" rel=\"noopener\">LinkedIn</a> for tech updates</li><li>Subscribe to my <a href=\"https://www.youtube.com/@svenmalvik\" rel=\"noopener\">YouTube channel</a> for weekly trance mixes</li><li>Check back here regularly for in-depth articles and insights</li></ul><p>Looking forward to sharing this journey with you!</p><p>~ Sven</p>",
      "date_published": "2025-01-01T00:00:00Z"
    }
    
  ]
}